---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
source: html/327ffde9-a930-e012-d51d-a1c3ae3fb75b.htm
---
# AnalyticalPowerSourceData Properties

Specifies whether the .NET object represents a valid Revit entity.